app/views/tickets/show.html.erb

    <div class="container">
        <h2 class="subtitle is-5"><strong><%= @ticket.comments.count %></strong> Comments</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."ticket_id" = ?  [["ticket_id", 11]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."ticket_id" = ?  [["ticket_id", 13]]