app/controllers/comments_controller.rb

    def create
        @ticket = Ticket.find(params[:ticket_id])
        @comment= @ticket.comments.create(params[:comment].permit(:name, :comment))
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "ticket_id") VALUES (?, ?, ?, ?, ?)  [["name", "Lushen"], ["comment", "Hello"], ["created_at", "2020-11-21 11:13:14.367873"], ["updated_at", "2020-11-21 11:13:14.367873"], ["ticket_id", 16]]