app/controllers/tickets_controller.rb

    def index
        @tickets=Ticket.all.order("created_at DESC") #A new variable object to store all the entries in the database in descending order
---
SELECT "tickets".* FROM "tickets" ORDER BY created_at DESC

    def create
      @ticket = Ticket.new(ticket_params)  #This is very similar to above but instead of making a blank spot, we are recording whatever was typed in those fields on the screen

      if @ticket.save #Once the CREATE button is clicked, it checks the database if the values were actually saved onto the database
---
INSERT INTO "tickets" ("student_id", "fault", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", "Lushen"], ["fault", "wsrgdfgdfsgfd"], ["created_at", "2020-10-18 20:24:16.329670"], ["updated_at", "2020-10-18 20:24:16.329670"]]

    def show
        @ticket = Ticket.find(params[:id]) #This now looks in the Ticket model with the ID given to the requested ticket and pulls it up from the database
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
      @ticket = Ticket.find(params[:id])

      if @ticket.update(ticket_params)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "tickets" SET "fault" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["fault", "The lights are not working. They are still not working \r\n"], ["updated_at", "2020-11-17 18:26:10.142018"], ["id", 4]]

    def edit
      @ticket = Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def destroy
      @ticket = Ticket.find(params[:id])
      @ticket.destroy
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 2]]